export interface Example {
  title: string;
  code: string;
}

export const examples: Example[] = [
{
    title: "ভেরিয়েবল ও ফাংশন",
    code: `ব্যাক্তি নাম = "মাহমুদ";
পরিবর্তনশীল বয়স = ২০;
বাক্য পেশা = "একজন কম্পিউটার প্রোগ্রামার"

অনুষ্ঠান পরিচয়() {
    লিখো("নাম: " + নাম);
    লিখো("বয়স: " + বয়স);
    লিখো("পেশা: " + পেশা);
}
পরিচয়();`
  },
  {
    title: "হ্যালো ওয়ার্ল্ড",
    code: `লিখো("হ্যালো, বিশ্ব! 🌍");
লিখো("BanglaScript এ স্বাগতম!");`
  },
  {
    title: "কন্ডিশনাল",
    code: `সংখ্যা নম্বর = ৮৫;
যদি (নম্বর >= ৮০) {
    লিখো("গ্রেড: A+ 🎉");
} নাহলে যদি (নম্বর >= ৬০) {
    লিখো("গ্রেড: B ✓");
} নাহলে {
    লিখো("আরো চেষ্টা করুন! 💪");
}`
  },
  {
    title: "লুপ",
    code: `লিখো("🔢 সংখ্যা গণনা:");
জন্য (সংখ্যা i = ১; i <= ৫; i++) {
    লিখো("→ সংখ্যা: " + i);
}
লিখো("\\n✨ সম্পন্ন!");`
  },
  {
    title: "অ্যারে",
    code: `শব্দ ফল = ["আম", "কলা", "আপেল", "কমলা"];
লিখো("🍎 ফলের তালিকা:");
জন্য (সংখ্যা i = ০; i < ফল.length; i++) {
    লিখো((i + ১) + ". " + ফল[i]);
}`
  },
  {
    title: "রিকার্সন",
    code: `অনুষ্ঠান ফ্যাক্টরিয়াল(n) {
    যদি (n <= ১) {
        প্রেরণ ১;
    }
    প্রেরণ n * ফ্যাক্টরিয়াল(n - ১);
}
সংখ্যা মান = ৫;
সংখ্যা ফলাফল = ফ্যাক্টরিয়াল(মান);
লিখো("ফ্যাক্টরিয়াল মান = " + ফলাফল);`
  },{
  title: "গ্রেড নির্ণায়ক",
  code: `ফাংশন শিক্ষার্থী_তালিকা() {
    প্রেরণ [
        { নাম: "রাহিম", নম্বর: ৮৫ },
        { নাম: "করিম", নম্বর: ৭২ },
        { নাম: "সাবিনা", নম্বর: ৫৫ }
    ];
}

ফাংশন গ্রেড_গণনা(তালিকা) {
    জন্য ( শিক্ষার্থী মধ্য তালিকা) {
        সংখ্যা নম্বর = শিক্ষার্থী.নম্বর;

        যদি (নম্বর >= ৮০) {
            শিক্ষার্থী.গ্রেড = "A+ 🎉";
        } নাহলে যদি (নম্বর >= ৬০) {
            শিক্ষার্থী.গ্রেড = "B ✓";
        } নাহলে {
            শিক্ষার্থী.গ্রেড = "আরো চেষ্টা করুন! 💪";
        }

        লিখো(শিক্ষার্থী.নাম + " পেয়েছে " + নম্বর + " নাম্বার — গ্রেড: " + শিক্ষার্থী.গ্রেড);
    }
}

// মূল প্রোগ্রাম চালানো
সংখ্যা শিক্ষার্থীরা = শিক্ষার্থী_তালিকা();
গ্রেড_গণনা(শিক্ষার্থীরা);
`},
{
    title: "অ্যাসিঙ্ক",
    code:`অ্যাসিঙ্ক অনুষ্ঠান দেখাও() {
  চেষ্টা {
    ধ্রুবক প্রতিক্রিয়া = অপেক্ষা fetch("https://bangla-script.vercel.app/json/keywords.json");
    ধ্রুবক প্রাপ্ত = অপেক্ষা প্রতিক্রিয়া.json();
    লিখো("✅ ফেচ সফল হয়েছে! মোট কীওয়ার্ড সংখ্যা:", Object.keys(প্রাপ্ত).length);
    লিখো("🔹 প্রথম কয়েকটি কীওয়ার্ড:");
    লিখো(JSON.শব্দসমূহ(প্রাপ্ত, শূন্য, ));
  } ধরো (ত্রুটি) {
    সমস্যা_লিখো("❌ ফেচ করতে সমস্যা:", ত্রুটি.বার্তা);
  }
}  // fetching data (under-development!)

দেখাও();
`
}
];